In [1]:
import pandas as pd
from sqlalchemy import create_engine

# Connect to SQLite DB
engine = create_engine("sqlite:///week1/sales_db.sqlite")

# Test by loading first 5 rows
df = pd.read_sql("SELECT * FROM sales LIMIT 5;", engine)
df

,order_id,customer_id,order_date,product,quantity,unit_price,revenue,order_month
0,1,1001,2024-01-01 00:00:00.000000,Widget A,2,9.99,19.98,2024-01
1,2,1002,2024-01-03 00:00:00.000000,Widget B,1,19.99,19.99,2024-01
2,3,1001,2024-01-07 00:00:00.000000,Widget C,5,4.50,22.50,2024-01
3,4,1003,2024-02-10 00:00:00.000000,Widget A,3,9.99,29.97,2024-02
4,5,1004,2024-02-15 00:00:00.000000,Widget B,2,19.99,39.98,2024-02

In [2]:
query = """
SELECT SUM(revenue) AS total_revenue
FROM sales;
"""
result = pd.read_sql(query, engine)
result

   total_revenue
0         441.24

In [3]:
query = """
SELECT customer_id, SUM(revenue) AS total_revenue
FROM sales
GROUP BY customer_id
ORDER BY total_revenue DESC
LIMIT 5;
"""
result = pd.read_sql(query, engine)
result

   customer_id  total_revenue
0         1001         122.44
1         1005          99.90
2         1007          89.97
3         1002          49.98
4         1004          39.98

In [4]:
query = """
SELECT order_month, SUM(revenue) AS monthly_revenue
FROM sales
GROUP BY order_month
ORDER BY order_month;
"""
result = pd.read_sql(query, engine)
result

  order_month  monthly_revenue
0     2024-01            62.47
1     2024-02            69.95
2     2024-03           209.85
3     2024-04            98.97

In [5]:
# Pandas calculation
pandas_monthly = pd.read_sql("SELECT * FROM sales;", engine)
pandas_monthly.groupby("order_month")["revenue"].sum()

order_month
2024-01     62.47
2024-02     69.95
2024-03    209.85
2024-04     98.97
Name: revenue, dtype: float64